p2p-bench/results/run5/scenarios/ll_p2p_on-c2/run_1.stdout.txt
WARNING 06-27 04:22:37 [cuda.py:838] Detected different devices in the system: NVIDIA GeForce RTX 5070, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti. Please make sure to set `CUDA_DEVICE_ORDER=PCI_BUS_ID` to avoid unexpected behavior.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7b6cf9568360>, trust_remote_code=False, seed=1234, num_prompts=32, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=2048, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url='http://127.0.0.1:8080', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=2, model='ll_p2p_on-c2', input_len=None, output_len=None, tokenizer='/data/models/Qwen/Qwen3.6-27B-FP8', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=8, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='results/run5/scenarios/ll_p2p_on-c2', result_filename='run_1.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-81128171-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-27 04:22:41 [utils.py:90] Sampling input_len from [4096, 4096] and output_len from [2048, 2048]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 8 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 2
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     32        
Failed requests:                         0         
Maximum request concurrency:             2         
Benchmark duration (s):                  1115.64   
Total input tokens:                      131072    
Total generated tokens:                  65536     
Request throughput (req/s):              0.03      
Output token throughput (tok/s):         58.74     
Peak output token throughput (tok/s):    32.00     
Peak concurrent requests:                3.00      
Total token throughput (tok/s):          176.23    
---------------Time to First Token----------------
Mean TTFT (ms):                          14097.89  
Median TTFT (ms):                        15005.00  
P50 TTFT (ms):                           15005.00  
P90 TTFT (ms):                           15032.82  
P99 TTFT (ms):                           18011.96  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          27.12     
Median TPOT (ms):                        25.17     
P50 TPOT (ms):                           25.17     
P90 TPOT (ms):                           32.75     
P99 TPOT (ms):                           59.81     
---------------Inter-token Latency----------------
Mean ITL (ms):                           85.68     
Median ITL (ms):                         66.04     
P50 ITL (ms):                            66.04     
P90 ITL (ms):                            66.42     
P99 ITL (ms):                            67.14     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          69610.76  
Median E2EL (ms):                        66105.81  
P50 E2EL (ms):                           66105.81  
P90 E2EL (ms):                           78390.41  
P99 E2EL (ms):                           133418.69 
==================================================


  0%|          | 0/8 [00:00<?, ?it/s]
 12%|█▎        | 1/8 [00:52<06:08, 52.67s/it]
 25%|██▌       | 2/8 [01:03<02:48, 28.04s/it]
 38%|███▊      | 3/8 [01:48<02:58, 35.75s/it]
 50%|█████     | 4/8 [02:11<02:02, 30.69s/it]
 62%|██████▎   | 5/8 [02:41<01:31, 30.48s/it]
 75%|███████▌  | 6/8 [03:03<00:55, 27.61s/it]
 88%|████████▊ | 7/8 [03:51<00:34, 34.39s/it]
100%|██████████| 8/8 [03:58<00:00, 25.67s/it]
100%|██████████| 8/8 [03:58<00:00, 29.85s/it]

  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [00:53<27:48, 53.82s/it]
  6%|▋         | 2/32 [01:11<16:16, 32.56s/it]
  9%|▉         | 3/32 [01:55<18:14, 37.73s/it]
 12%|█▎        | 4/32 [02:44<19:42, 42.24s/it]
 16%|█▌        | 5/32 [03:29<19:24, 43.13s/it]
 19%|█▉        | 6/32 [03:44<14:37, 33.76s/it]
 22%|██▏       | 7/32 [04:32<15:59, 38.40s/it]
 25%|██▌       | 8/32 [05:01<14:07, 35.29s/it]
 28%|██▊       | 9/32 [05:55<15:46, 41.15s/it]
 31%|███▏      | 10/32 [06:19<13:08, 35.82s/it]
 34%|███▍      | 11/32 [06:59<13:02, 37.26s/it]
 38%|███▊      | 12/32 [07:31<11:48, 35.42s/it]
 41%|████      | 13/32 [08:06<11:13, 35.44s/it]
 44%|████▍     | 14/32 [08:42<10:42, 35.70s/it]
 47%|████▋     | 15/32 [09:12<09:37, 33.99s/it]
 50%|█████     | 16/32 [09:52<09:33, 35.84s/it]
 53%|█████▎    | 17/32 [10:18<08:10, 32.68s/it]
 56%|█████▋    | 18/32 [10:58<08:08, 34.90s/it]
 59%|█████▉    | 19/32 [11:22<06:50, 31.58s/it]
 62%|██████▎   | 20/32 [12:04<06:58, 34.88s/it]
 66%|██████▌   | 21/32 [12:29<05:51, 31.94s/it]
 69%|██████▉   | 22/32 [13:23<06:23, 38.37s/it]
 72%|███████▏  | 23/32 [13:40<04:47, 31.98s/it]
 75%|███████▌  | 24/32 [14:29<04:56, 37.04s/it]
 78%|███████▊  | 25/32 [14:44<03:32, 30.42s/it]
 81%|████████▏ | 26/32 [15:33<03:37, 36.21s/it]
 84%|████████▍ | 27/32 [16:00<02:47, 33.45s/it]
 88%|████████▊ | 28/32 [16:38<02:18, 34.58s/it]
 91%|█████████ | 29/32 [17:06<01:38, 32.72s/it]
 94%|█████████▍| 30/32 [17:42<01:07, 33.57s/it]
 97%|█████████▋| 31/32 [18:32<00:38, 38.57s/it]
100%|██████████| 32/32 [18:35<00:00, 28.00s/it]
100%|██████████| 32/32 [18:35<00:00, 34.86s/it]